# Страница содержит в себе задания на разные темы (Редактируется).



# ------------------------------------------------------ #
# --- Домашнее задание / Типы данных и работа с ними --- #
# ------------------------------------------------------ #



# Задание №1. Инверсия.
# Напишите программу, которая будет из 0 делать 1, а из 1 - 0. В решении запрещено использовать условные операторы. На вход дается число 0 или 1.

# Пример ввода:
# 0

# Пример вывода:
# 1

# Пример ввода:
# 1

# Пример вывода:
# 0


# Задание №2. Интересная табличка.
# Сделайте табличку, состоящую из слова "Табличка" и разделитей размером N x M. На ввод даются целые числа - N и M. Необходимо делать без циклов.

# Пример ввода:
# 4
# 3

# Пример вывода:

# | Табличка | Табличка | Табличка | Табличка |
# | Табличка | Табличка | Табличка | Табличка |
# | Табличка | Табличка | Табличка | Табличка |


# Задание №3. Почтенное приветствие.
# Выведите строку "Привет" 30 раз.

# Пример:
# Вывод:
# ПриветПриветПривет...


# Задание №4. Арифметическое округление.
# Напишите программу, которая будет округлять число по российским правилам (0.5 окргуляется в большую сторону). На вход дается вещественное число.

# Пример ввода 1:
# 3.7

# Пример вывода 1:
# 4

# Пример ввода 2:
# 8.1

# Пример вывода 2:
# 8


# Задача №5. Следующее четное.
# Напишите программу, которая выводит следующее четное число. На вход дается целое число.

# Пример ввода 1:
# 6

# Пример вывода 1:
# 8

# Пример ввода 2:
# 11

# Пример вывода 2:
# 12



# ------------------------------------ #
# --- Домашнее задание / Ветвления --- #
# ------------------------------------ #



# ------------------------------------ #
# --- Домашнее задание / Циклы - I --- #
# ------------------------------------ #



# Задание №1. Внимание - акция!
# Мы пришли в магазин и видим, что есть много товаров со скидками, но есть условие - на товар дается скидка 50% , если его цена больше 500 рублей. Напишите цены товаров - со скидкой, если она есть и без скидки, если условие не выполяется.

# На ввод мы получаем несколько значений: 1ое - количество товаров (пусть n) , далее - n строк с ценами товаров! Наща задача - написать каждую цену!

# Пример:
# Ввод:
# 4
# 100
# 900
# 98
# 4000

# Вывод:
# 100
# 450
# 98
# 2000


# Задание №2.  Вирусы - Берегись!
# На наш компьютер пробрался вирус. Мы его нашли и удалили! Но он оставил после себя несколько плохих вещей! Испортил строчки! Нам нужно починить их и убрать ненужные символы (Символы # или &).

# Пример:
# Ввод:
# &П&#ри&в#ет! Как# де#ла?#

# Вывод:
# Привет! Как дела?


# Задание №3. Шифр - I. Сумма чисел.
# Мы попали в серьезный школьный проект и нам дали первое испытание - его суть поработать с шифрованием. Само шифрование не так сложно - шифр числа - сумма его цифр. Наше задание - написать алгоритм для зашфровки чисел!

# Пример:
# Ввод:
# 5020302

# Вывод:
# 12


# Задание №4. Весело шагаем.
# Ребята придумали соревнование - прыжки по ступенькам. Но для начала им нужно все расчитать - понять вообще какое минимальное количество шагов можно сделать для преодоления лестницы. Начинают все с пола (Назовем это нулевой ступенькой) и идут до ступеньки под номером N (N вводится), но есть отличия - у всех шаг разный: кто-то может пройти и 5 ступенек за раз, а кто-то с трудом справляется и с 3. Поэтому эти данные нам тоже даются - S (шаг человека в ступеньках). 

# На вход дается два числа - N (количество ступенек), S (шаг человека в ступеньках). 

# Нужно вывести номера всех ступенек, на которые попадет человек (Включая первую и последнюю).

# Пример:
# Ввод:
# 12
# 4

# Вывод:
# 0
# 4
# 8


# Задание №5. Шифр - II. Самая большая цифра.
# После попадания в проект нас позвали посотрудничать с другой серьезной компанией, которая также занимается шифрами - в этот раз задание немного отличается, но суть та же! Нам нужно снова зашифровать данные. Шифром числа является самое его большое число! Наше задание - найти это самое число!

# Пример:
# Ввод:
# 46241628

# Вывод:
# 8


# ------------------------------------- #
# --- Домашнее задание / Циклы - II --- #
# ------------------------------------- #



# Задание №1. Количество чисел, кратных 9. 
# Сколько вводимых чисел, которые кратны 9. Окончанием ввода считается цифра 0.

# Пример:
# 20
# 17
# 28
# 0
# --> 2


# Задание №2. Количество кроликов в зоопарке. 
# Мы пришли в зоопарк и хотим нашему товарищу (любителю кроликов) всех кроликов! Но для этого нужно знать сколько их - поэтому мы пришли заранее, чтобы посчитать их среди всех остальных животных! Нужно посчитать сколько кроликов в нашем зоопарке. Окончанием ввода является пустая строка.

# Пример:
# жираф
# кролик
# слон
# кролик
# 
# --> 2


# Задание №3. Отличие на 6.
# Сколько вводимых чисел, у которых левое число на 6 отличается от правого! Числа только двухзначные. Окончанием ввода считается цифра 0.

# Пример:
# 20
# 17
# 28
# 0
# --> 2

# Задание №4. Магическое число.
# Много лет назад один из народов вывел, как казалось, магическое число - написав его на стене, случались чудеса! Магическим число становилось, если число было кратно 7 и оканчивалось на 4! Давайте напишем программу, которая будет выяснять, является ли число магическим! *На вход дается целое число.*

# Пример:
# Ввод - I:
# 14

# Вывод - I:
# Число - Магическое!

# Ввод - II:
# 82

# Вывод - II:
# Число - не магическое(


# Задание №5. Магическое число - II.
# Мы дальше помогаем ученым изучать древность! Задание в этот раз похоже на прошлое - но условия изменились: теперь число магическое - когда оно трехзначное и если сумма его крайних чисел равна среднему! Наша задача - выяснить это! *На вход дается целое трехзначное число.*

# Пример:
# Ввод - I:
# 143

# Вывод - I:
# Число - магическое!

# Ввод - II:
# 987

# Вывод - II:
# Число - не магическое(


# Задание №6. Средний рост одноклассников. 
# Мальчики в школе решили посоревноваться. Так как спортивные игры - долго и не так быстро, ребята решили посоревноваться средним ростом между классами. Наша задача - понять какой средний рост у класса. Данные по каждому однокласснику вводятся на новой строке! Окончанием ввода считается цифра 0.

# Пример:
# 160
# 170
# 150
# 155
# 165
# 0
# --> 160


# Задание №7. Количество поряд идущих жирафов. 
# Мы снова пришли в зоопарк и хотим понять насколько общительны между собой жирафы. Для этого нам надо высчитать какое максимальное количество жирафов стоит рядом (подряд). Наша задача - сделать это! Окончанием ввода является пустая строка.

# Пример:
# жираф
# слон
# жираф
# жираф
# жираф
# кролик
# 
# --> 3


# Задание №8. Немного математики.
# Мы продолжаем искать интересные цепочечки, но в этот раз мы с ними встретились на уроке математики. Учитель сказал - кто найдет наибольшую последовательность, где следующее число отличается от предыдущего на 12, тот победит! Давайте напишем программу, которая поможет нам в этом! В качестве ответа надо вывести размер этой последовательности! Окончанием ввода считается число 0.

# Пример:
# 11
# 23
# 30
# 42
# 54
# 55
# 0
# --> 3



# ----------------------------------- #
# --- Домашнее задание / Строки I --- #
# ----------------------------------- #



# Задание №1. Индексы.
# Вводится строчка. Мы должны вывести два ее последних символа!

# Пример:
# Арбуз --> уз
# Компьютер --> ер


# Задание №2. Индексы - II
# Вводится строчка (Гарантированно, больше, чем 10 символов) Мы должны вывести символы с 4 до 8!

# Пример:
# Лампачка накаливания --> чка
# Крутейший ноутбук --> йши


# Задание №3. Счет до нового года!
# Скоро новый год и нам нужно подготовиться - для этого мы решили написать счетчик, который будет указывать количество оставшихся секунд до нового года! Вводится количество секунд, нам нужно сделать отсчет.

# Пример:
# Ввод - 3
# Вывод:
# До нового года осталось: 3 
# До нового года осталось: 2
# До нового года осталось: 1
# До нового года осталось: 0
# Урааа!


# Задание №4. Проверка на возраст.
# Пользователь регестрируется в игре. Но для регистрации ему нужно указать свой возраст (В формате числа). Нам нужно проверить, является ли введенное числом.

# Пример:
# ва12вф --> Формат неверен.
# 10 --> Формат верен.


# Задание №5. Считаем слова.
# Представим, что мы пишем проект! И в нем есть критерий - количество слов не должно превышать 10. Word, в котором мы делали задание сломался. Поэтому мы должны написать программу, которая поможет нам в этом! На вход мы принимаем строчку. Возвращаем результат - укладываемся мы в критерии или нет.

# Пример:
# Клара у Карла украла Кораллы. --> По критериям подходит. Слов - 5.
# Раз два три четыре пять, Раз два три четыре пять. Один. --> По критериям не подходит. Слов - 11.


# Задание №6. Вредные символы.
# У нас вводится строка, в которой могут содержаться вредные символы (Назовем вредным символами - "#", "@").Нам нужно посчитать сколько вредных символов в введенной строке.


# Пример:
# Ар#буз! --> Всего 1.
# Яблоко! --> Всего 0.


# Задание №7. Красиво оформляем текст.
# Мы работаем редакторами в газете. И мы хотим понять верно ли написан заголовок. Правила такие - Первая буква должна быть большой, а на конце должен быть "!" или "."

# Пример:
# это заголовок газеты, --> Не подходит
# Шокирующая новость! --> Не подходит


# Задание №8. Название магазина.
# Мы занимаемся дизайном и к нас пришли с заказом -> сделать вывеску с названием вертикальной!

# Пример:
# Ввод: Магнит
# Вывод:
# М
# А
# Г
# Н
# И
# Т


# Задание №9. Слишком длинная строка.
# Один новостной сайт позвал нас помочь им. У них была такая проблема - не всегда получается придумать название к статье. В таких случаях названием становятся первые 40 символов статьи. Давайте поможем сайту, написав программу, которая будет выдавать название длинной 40 символов! Ну и чтобы название в случайный момент не обрбалось - давайте в конце добавлять многоточие! *На вход подается строка.*

# Пример:

# Ввод:
#Давным-давно в далекой далекой галактике жил был...

# Вывод:
# Давным-давно в далекой далекой галакт...


# Задание №10. Палиндром.
# Что такое палиндром? А это такая строка / цифра, которая и справа налево и слева направо читается одинаково. К примеру - 12321 или "анна". Наша задача понять является ли введенная нами строка палиндромом!

# Пример:
# анна --> Это палиндром!
# абоба --> Это палиндром!
# мама --> Это не палиндром :(


# Задание №11. Палиндром - II.
# С палиндромами познакомились - время работать с более серьезными задачами. Если до этого мы проверяли только одно слово, то теперь будем проверять целую строчку! Наша задача - понять, является ли строчка палиндромом (Не учитывайте регистр, а также игнорируйте пробелы).

# Пример:
# А роза упала на лапу Азора --> Палиндром
# 123 456 7 654 321 --> Палиндром
# 1234 54 323 --> Палиндром



# ------------------------------------ #
# --- Домашнее задание / Строки II --- #
# ------------------------------------ #



# Задание №1. Непонятное шифрование.
# Наш товарищ занимается шифрами, но он еще не так опытен и не понимает основ криптографии. Несмотря на это он решил сделать свой шифр. Его суть заключается в том, что он удаляет каждый 3 символ строчки. Давайте поможет ему в этом нелегком деле.

# Пример.

# Ввод:
# Клара у Карла украла кораллы.

# Вывод:
# Круааклкаы


# Задание №2. Математическая лестница.
# Мы придумываем оформление для одной из школ с углубленным изучением математики. Нам дали задание - сделать математическую лестницу. Напишите алгоритм, который вам в этом поможет!

# Пример:

# Ввод:
# 3

# Вывод:
# 1
# 12
# 123


# Задание №3. Непонятный список.
# Преподаватель составил список группы, но сделал это немного странно - у некоторых ребят нет отчества, у кого-то вообще только имя. Несмотря на это, нам нужно понять сколько в итоге у нас будет одноклассников. Наша задача - понять число ребят в группе.

# Пример:

# Ввод:
# | Антонов Антон | Иванов Иван Иванович | Егоров | Андреев Андрей | Василий |

# Вывод:
# Всего учеников - 5.


# Задание №4. Комментарии в коде.
# Наш товарищ начал изучать программирование, он уже изучил пару функцийи познакомился с комментариями в коде. Как использовать комментарии корректно он не очень понял и поэтому вставляет их везде. Давайте поможем убрать комментарии из кода и поможем нашему другу! На ввод подаются строки до момента, пока не будет введена пустая строка.

# Пример:

# Ввод:
#  print('Hello, World')
#      print('hi!')
# '''print(2+5)'''# #
# 

# Вывод:
# print('Hello, World')
# print('hi!')
# print(2+5)


# Задание №5. Аббревиатура.
# Как вы знаете, в мире все делается для того, чтобы было проще жить. Аббревиатуры - вещь, появившаяся из этой области, она предназначены для ускорения чтения и написания. К примеру, МТС - Мобильные Телекоммуникационные Системы. Аббревиатур существует очень много, но сокращать миллионы названий вручную - дело тяжелое. Давайте напишем алгоритм, который из слов делает аббревиатуру (И делает все буквы большими).

# Пример:

# Ввод:
# Высшая школа Экономики

# Вывод:
# ВШЭ


# Задание №6. Непонятное Шифрование - II.
# Наш товарищ пошел в сфере шифрование дальше и придумал новый алгоритм - теперь шифром строчки является строка, состоящая из символов, которые стоят на местах, являющихся квадртами. К примеру, строчка "шифрование": ш - 0, и - 1, о - 4, е - 9. Давайте поможем нашему товарищу в его деле.

# Пример:

# Ввод:
# Шифрование

# Вывод:
# шиое



# ----------------------------------- #
# --- Домашнее задание / Списки I --- #
# ----------------------------------- #



# Задание №1. Список учеников - I
# Учитель информатики обратился к нам за помощью - ему нужно определить сколько всего учеников в его группе. Почему он не может сам - он сегодня забыл свой компьютер, а список (M) немаленький. Давайте поможем ему определить размер списка.

# Пример:

# Ввод:
# M - случайный список. Пусть M = ['Антон', 'Артём',  'Аркадий', 'Георгий', 'Андрей',]

# Вывод:
# Всего в группе 5 учеников.


# Задание №2. Ищем нарушителя.
# Школа организовала мероприятие и позвала ребят, которые учатся только на одни пятерки! Но один мальчик по имени Барборис - заядлый двоечник и хулиган! Он хочет проникнуть на мероприятие и испортить его. Давайте по спискам поймем - зарегистрировался ли Барборис или нет.

# Пример:

# Ввод 1:
# M - случайный список. Пусть M = ['Валера', 'Артём', 'Барбарис', 'Георгий', 'Андрей',]

# Вывод 1:
# Барборис Зарегистрировался!

# Ввод 2:
# M - случайный список. Пусть M = ['Валера', 'Артём', 'Елена', 'Георгий', 'Андрей',]

# Вывод 2:
# Барбориса не будет!


# Задание №3. Товары IKEA.
# Нам дали задание придумать названия товаров для магазина IKEA. Как вы знаете, названия там крайне необычные, но предположим, что у них есть критерий - длина названия должна быть больше 4 букв! Давайте будем записывать в наш список товаров те, которые удовлетворяют условию! (Ввод - построчный. Окончанием ввода является пустая строка)

# Пример:

# Ввод:
# fhsdoe
# eo
# doifho
# eif
# fseoih
# 

# Вывод:
# Ваш список - ['fhsdoe', 'doifho', 'fseoih']


# Задание №4. Допуск на соревнования.
# В какой-то момент ребята из школы проходили диспанцеризацию, и врач записал рост ребят в очень странном формате - список (M), где чередуются имена и их рост: [имя1, рост1, имя2, рост2...]. Сейчас же этим списком хочет воспользоваться учитель физкультуры - он отбирает ребят, рост которых больше 170 см! Давайте поможем ему и выведем имена этих ребят.

# Пример:

# Ввод:
# M - случайный список. Пусть M = ['Антон', 160, 'Артём', 180, 'Аркадий', 156, 'Георгий', 175, 'Андрей', 169]

# Вывод:
# Артём
# Георгий


# Задание №5. Список учеников - II
# К нам снова пришел учитель информатики. В этот раз ему нужно отправить списки ребят на олимпиаду по физкультуре, но есть проблема - все имена должны быть в определенном формате - "Имя Фамилия" (Каждое слово с большой буквы). Преподаватель все также сидит без компьютера - давайте напишем алгоритм, которые возвращает список ребят в верном формате.

# Пример:

# Ввод:
# M - случайный список. Пусть M = ['Антон антонов', 'Артём Артёмов',  'аркаша АРКАШЕВ', 'ГОША Гошев', 'Андрей Андреев']

# Вывод:
# Нужный список - ['Антон Антонов', 'Артём Артёмов',  'Аркаша Аркашев', 'Гоша Гошев', 'Андрей Андреев']


# Задание №6. Уникальные элементы.
# Мы работаем в серьезной компании. Нам дали задание - оптимизировать работу программы, которая делает рассылку клиентам. Оказалось, что это можно легко сделать, ведь в списке присутствуют дубликаты и некоторым клиентам приходит два письма, хотя должно одно. Наша задача - убрать дубликаты и вывести список, состоящий из уникальных элементов! (Клиенты пронумерованы -> нужно найти уникальные числа)

# Пример:

# Ввод:
# M - случайный список. Пусть M = [18, 23, 12, 18, 3, 23]

# Вывод:
# 18 23 12 3


# Задание №7. Немного сортировки.
# Пусть у нас есть список M, состоящий из чисел. Наша задача - вывести три самых маленьких числа из этого списка.

# Пример:

# Ввод:
# M - случайный список. Пусть M = [24, 0, 7, -99, 4]

# Вывод:
# -99 0 4



# ------------------------------------ #
# --- Домашнее задание / Списки II --- #
# ------------------------------------ #



'''
Список (M) ниже пригодится для выполнения заданий.
Структура списка - ['Продукт', "вес (кг)", "цена (за кг)"]
'''

M = [["Яблоки", 1, 70],
     ["Огурцы", 1.5, 110],
     ["Помидоры", 1, 200],
     ["Лук", 0.5, 50],
     ["Картошка", 4, 40]]


# Задание №1. Продукты - I.
# Вывести размер корзины.


# Задание №2. Продукты - II.
# Найти сумму, которую покупатель потратит на всю корзину и вывести ее.


# Задание №3. Продукты - III.
# Найти среднюю цену продуктов из корзины за кг и вывести ее.


# Задание №4. Продукты - IV.
# Вывести отсортированный по цене за кг список продуктов.

# Задание №5. Продукты - V.
# Вывести отсортированный по общей цене (кг * цену/кг) список продуктов.


# Задание №6. Продукты - VI.
# 1. Добавить в корзину любой товар.
# 1. Удалить любой из товаров
# 2. Изменить цену картошки - поднять ее на 10 руб/кг
# 3. Добавьте к весу огурцов 0.5 кг.


'''
Список (M) ниже пригодится для выполнения заданий.
Структура списка -  числа.
'''

M = [200, 0.5, 5, 100, 2, -50, -2, -4, 20, 0, 1, 2.4]


# Задание №7. Отрицательные числа.
# Нужно определить сколько отрицательных чисел содержится в списке M.


# Задание №8. Вещественные числа.
# Вещественный числа - это числа, у которых есть дробная часть (4.5, 2.1, 4,2). Нужно определить сколько таких (вещественных чисел) есть в списке M.


# Задание №9. Сотня!
# Найти пары соседних чисел (Из списка M), произведение которых дает 100! Необходимо вывести их индексы.


# Задание №10. Числа - пары.
# Найти такую пару чисел (Из списка M), разность у которой самая большая.


# Задание №11. Числа - тройки.
# Найти такую тройку чисел (Из списка M), проивезедение у которых было бы самым большим.



# ------------------------------------- #
# --- Домашнее задание / Списки III --- #
# ------------------------------------- #



# Задание №1. Длина рек.
# Нас позвали работать в одну из команд, которая занимается природными делами! Задание они нам дали такое - посчитать среднюю длину рек. Все длины есть (в виде списке M), давайте выполним задание!

# На вход подается список длин (в км) некоторого количества рек!

# Необходимо вывести среднюю длину рек!

# Пример:

# Ввод:
# M - случайный список. Пусть M = [5550, 4248, 5052, 2989, 5410, 4692]

# Вывод:
# Средняя длина рек - 4656.83... км.


# Задание №2. Призы - I.
# В одной из школ утвердили стипендию, дают ее только одному человеку - тому, кто выиграл больше всего олимпиад за учебный год. И вот этот момент настал - год закончился и надо определить кто будет победителем.

# На вход подается список из победителей всех возможных олимпиад (И так как участсовать можно в большом количестве олимпиад, то понятное дело, что некоторые имена могут дублироваться). 

# Необходимо вывести имя победителя и количество выигранных олимпиад. Если их несколько - вывести того, у имя по алфавиту идет раньше.

# Пример:

# Ввод:
# M - случайный список. Пусть M = ['Антон', 'Андрей', 'Аркадий', 'Артём', 'Андрей', 'Елена', 'Андрей', 'Соня', 'Василий']

# Вывод:
# Андрей - 3


# Задание №3. Призы - II.
# Наступил следующий год - школа выделила дополнительные средства на финансирование стипендий. Правила такие же, как и в прошлом году, но теперь награждается два человека (которые выиграли больше всего олимпиад).

# На вход подается список из победителей всех возможных олимпиад. 

# Необходимо вывести имя победителя и количество выигранных олимпиад. Если победителей больше, чем 2 (у некоторых одинаковое количество очков), вывести вывести тех, у имя по алфавиту идет раньше.

# Пример:

# Ввод:
# M - случайный список. Пусть M = ['Антон', 'Андрей', 'Cоня', 'Артём', 'Андрей', 'Елена', 'Андрей', 'Соня', 'Василий']

# Вывод:
# Андрей - 3
# Соня - 2


# Задание №4. Списки в порядке.
# Мы работаем в большой компании и нам дали особое задание - привести все списки в порядок. Но что с ними было не так? В списке и слова и числа - все это хранилось в формате строк. Теперь же, если строчка - число, то нам нужно привести ее именно в формат числа!

# Пример:

# Ввод:
# M - случайный список. Пусть M = ['123', '29', 'Арбуз', '283', 'Яблоко', '292', 'Малина', '20', '1']

# Вывод:
# Измененный список - [123, 20, 'Арбуз', 283, 'Яблоко', 292, 'Малина', 20, 1]


# Задание №5*. Удивительная пара.
# Найти и вывести из списка такие пары чисел, произведение которых дают 10.

# Пример:

# Ввод:
# M - случайный список. Пусть M = [-10, 18, 5, 2, 48, 100, -1, 23, 0, 39]

# Вывод:
# 5 2
# -10 -1



# -- Пояснение -- 

# M = [-10, 20, 30, -2, 30] - это последовательность

# Все, что ниже - это все можно назвать подпоследовательностью.
# Ведь ПОДпоследовательность - то, что является частью последовательности!
# [-10], [20], [30], [-2], [30]
# [-10, 20], [20, 30], [30, -2], [-2, 30]
# [-10, 20, 30], [20, 30, -2], [30, -2, 30]
# [-10, 20, 30, -2], [20, 30, -2, 30]
# [-10, 20, 30, -2, 30]  # Дада и целая последовательность - тоже, по сути, подпоследовательность!



# Задание №6*. Последовательность - I. 
# У нас есть последовательность чисел. Возрастающая последовательность - то, когда у которой последующий элемент всегда не меньше предыдущего! Нам необходимо найти максимальную сумму возрастающей подпоследовательности. К примеру, у M - [3,5,6,2,8,10,2] подпоследовательность 2,8,10 дает самую большую сумму! Необходимо вывести саму подпоследовательность и ее сумму.

# Пример:

# Ввод:
# M - случайный список. Пусть M = [3,5,6,2,8,10,2]

# Вывод:
# [2, 8, 10]
# 20

# Задание №7*. Последовательность - II.
# Продолжаем работать с последовательностями! В этот раз нам нужно нвйти максимальную сумму любой подпоследовательности.  Необходимо вывести саму подпоследовательность и ее сумму.

# Пример: 

# Ввод:
# M - случайный список. Пусть M = [-10, 20, 30, -2, 30]

# Вывод:
# [20, 30, -2, 30]
# 78



# ------------------------------------ #
# --- Домашнее задание / Множества --- #
# ------------------------------------ #



# Задание №1. Количество слов.
# Дана строчка из слов разных форматов: написание может разниться - запись может быть как с маленькими буквами, так и с большими. Необходимо определить количество различных слов в строке.

# Пример:

# Ввод:
# She sells sea shells on the sea shore; The shells that she sells are sea shells I'm sure. So if she sells sea shells on the sea shore, I'm sure that the shells are sea shore shells.

# Вывод:
# 19


# Задание №2. Множества чисел.
# Дана строчка из чисел разных форматов - как целых, так и дробных. Выведите через запятую все уникальные числа в отсортированном порядке и их количество

# Пример:

# Ввод:
# 10 1.0 20 8 20.0 -5 2.5 1 0.5

# Вывод:
# -5.0, 0.5, 1.0, 2.5, 8.0, 10.0, 20.0
# 7


# Задание №3. Факультативы - I.
# Студентам в университете дали возможность записаться на любой факультатив - всего их было три. Многие из ребят записались всего лишь на один из них, некоторые же выбрали сразу два факультатива, а кто-то записался на все три. Давайте найдем общее количество ребят, которые записались хоть на один факультатив. 

# На вход подается три строчки с именами (разделенные запятыми) - сначала ребята, которые записались на 1 факультатив, потом те, кто на 2 и последняя строчка - на 3 факультатив.

# Необходимо вывести через запятую в отсортированном виде имена всех ребят, записавшихся на факультативы! А также их количество!

# Пример:

# Ввод:
# Соня, Даня, Андрей, Аркадий
# Аркадий, Валера, Соня
# Андрей, Валера, Настя, Даня

# Вывод:
# Андрей, Аркадий, Валера, Даня, Настя, Соня.
# 6


# Задание №4. Факультативы - II.
# Студенты все также учатся на своих факультативах и университет решил посчитать какое количество ребят, которые записались только на один факуьтатив. Давайте поможем университету в этой задаче.

# На вход подается три строчки с именами (разделенные запятыми) - сначала ребята, которые записались на 1 факультатив, потом те, кто на 2 и последняя строчка - на 3 факультатив.

# Необходимо вывести через запятую в отсортированном виде имена всех ребят, записавшихся только на один факультатив! А также их количество!

# Пример:

# Ввод:
# Соня, Даня, Андрей, Аркадий
# Аркадий, Валера, Соня, Ваня
# Андрей, Валера, Настя, Даня


# Вывод:
# Ваня, Настя.
# 2


# Задание №5. Факультативы - III.
# Университет все дальше совершествуется и в этот раз ему понадобилось проанализировать сколько ребят записались только на два факультатива. Давайте решим эту задачу.

# На вход подается три строчки с именами (разделенные запятыми) - сначала ребята, которые записались на 1 факультатив, потом те, кто на 2 и последняя строчка - на 3 факультатив.

# Необходимо вывести через запятую в отсортированном виде имена всех ребят, записавшихся на два любых факуьлтатива! А также их количество!

# Пример:

# Ввод:
# Соня, Андрей, Аркадий
# Аркадий, Валера, Соня, Ваня
# Андрей, Валера, Настя, Даня, Соня

# Вывод:
# Андрей, Аркадий, Валера.
# 3


# Задание №6. Чемпионат по запоминанию - II.
# Нас пригласили на чемпионат по запоминанию аналитиком. Что такое чемпионат по запоминанию? Это когда конкурсантам на некоторое время дается текст (в нашем случае последовательность неповторяющихся букв) для чтения, после чего они должны воспроизвести его на скорость. Наша задача - проанализировать результаты - сказать какие буквы упущены, а какие наоборт - лишние.

# На вход подается две строчки - сначала верная строчка, потом та, которую отправил участник на проверку.

# Необходимо вывести лишние буквы в формате "Лишние буквы - ...." и пропущенные буквы в формате "Пропущенные буквы - ...."

# Пример:

# Ввод:
# qxwgyimdbroavl
# qxwgzyimdbrvl

# Вывод:
# Лишние буквы - a, o.
# Пропущенные буквы - z.


# Задание №7. Телефонные номера.
# В один момент, записывая очередной контакт в записную книжку мы обнаружили, что у нас уже есть этот номер, но забит он немного в ином формате: вместо +7 999 999 99-99 у нас было записано 8999 999 99 99. Также оказалось, что у нас еще были номера, которые записаны в формате +7(999)999-99-99, 8 9 9 9 9 9 9 9 99 9 (В общем, много разных вариантов, где различаются пробелы, скобки или знаки тире). Давайте приведем нашу записную книжку в единый формат (+7 999 999 99 99).

# На вход подается сначала N - количество телефонных номеров, а потом сами номера.

# Необходимо вывести нашу очищенную телефонную книгу. Каждый номер телефона должен быть на новой строчке.

# Пример:

# Ввод:
# 5
# +7 999 999 99-99
# +7 (999) 111 11 11
# 8 (999) 999 99 99
# +7 (999) 111 11 11
# 8 (999) 999 12 34

# Вывод:
# +7 999 999 99 99
# +7 999 999 12 34
# +7 999 111 11 11



# -------------------------------------- #
# --- Домашнее задание / Словари - I --- #
# -------------------------------------- #


# Soon...
